Revit 2027 API
Transaction(Document, String) Constructor
 Instantiates a transaction object
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public Transaction(
	Document document,
	string name
)
Public Sub New (
	document As Document,
	name As String
)
public:
Transaction(
	Document^ document,
	String^ name
)
new :
        document : Document *
        name : string -> Transaction
Parameters
document Document
 The document for which this transaction is going to be used.
name String
 The name of the transaction. This name will appear in the undo menu once the transaction is successfully committed. The name must not be empty. The name can be reset later by either calling SetName(String) or by using the name argument in the Start(String) method.
Exceptions
Exception | Condition
ArgumentException |  The name argument is an empty string. -or- Document is a linked file. Transactions can only be used in primary documents (projects or families.)
ArgumentNullException |  A non-optional argument was null
Remarks
 The transaction does not start by creating a transaction object. One of the 'Start' methods will need to be called in order to start this transaction.
See Also
Reference
Transaction Class
Transaction Overload
Autodesk.Revit.DB Namespace